---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateParamName
source: html/7d7d83d9-c88f-7e51-ec3d-e7588e33bc94.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateParamName Property

Family parameters have duplicate names.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateParamName { get; }
```